'use strict';
// УМОВА ПОТІМ РІШЕННЯ
// Задача №1
// Що потрапить в консоль?

// let someVar = 0;
// ++someVar;

// if (someVar) {
//     console.log(someVar);
// }
// Нуу створюємо змінну, збільшуємо її на 1 перевіряємо її оскільки всі цифри, що не 0 це true, то змінна виводиться.
// В консолі буде (1)

// Задача №2
// За допомогою циклу FOR виведіть в консоль 10 рядків:
// Пункт №1
// Пункт №2
// і т.д.
// Ну якось так
// for (let i = 0; i < 10; i++) {
//     console.log(`Пункт №${i + 1}`);
// }

// Задача №3
// Що потрапить в консоль ?
// if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
// 	console.log('000');
// }
// ОООй ці пріорітети так ну давай спростимо
// (40 <= 10 || 15 < 5 && 10 <= "10" || 20 === "20")
// (false || false && true || false)
// (false || false || false) тобто буде false умова провалиться й в консолі нічого не буде

// Задача №4
// Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
// Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
// Функція не має повертати NaN, Infinite або помилку
function divving_show(a = 1, b = 1) {
    let result = a / b;
    if (b === 0) {
        return console.log('Помилка: Некоректні аргументи для ділення');
    } else if (isNaN(result) || !isFinite(result)) {
        return console.log('Помилка: Ділення веде до нескінченності або нечислового результату');
    } else {
        return console.log(`Результат ділення: ${result}`);
    }
}
divving_show();
divving_show(-5);
divving_show('a', 2);
divving_show(10, 5);
divving_show(5, 10);
divving_show(-5, 5);
divving_show(7, 0);
divving_show(0, 7);
divving_show(0, 0);

// Задача №5
// Створіть масив даних - 5 елементів, один з яких число 10
// Обробіть масив за допомогою методу перебору
// Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль
let jusr_var;
let arr = ['a', 'b', jusr_var, 10, -2];
arr.forEach((element) => {
    if (element === 10) console.log(element);
});
